# SetSystemsAnalysisWorkflows Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..SetSystemsAnalysisWorkflows Method
Application Class See Also
---
Sets name and path information identifying systems analysis workflow files.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public void SetSystemsAnalysisWorkflows(
	IDictionary<string, string> paths
)
```

Visual Basic
---
```text
Public Sub SetSystemsAnalysisWorkflows ( _
	paths As IDictionary(Of String, String) _
)
```

Visual C++
---
```text
public:
void SetSystemsAnalysisWorkflows(
	IDictionary<String^, String^>^ paths
)
```

# ### Parameters
paths
    Type: System.Collections.Generic..::..IDictionary<(Of <(<'String, String>)>)> The map of systems analysis workflows.
# Remarks
The map should be specified as a key that is the name of the systems analysis workflow, and a value that is the path to the workflow file.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace